## production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 10 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                NAME                                |
|--------|--------------------------------------------------------------------|
| update | `aws_iam_openid_connect_provider.notification-canada-ca`           |
|        | `aws_iam_role.admin`                                               |
|        | `aws_iam_role.api`                                                 |
|        | `aws_iam_role.celery`                                              |
|        | `aws_iam_role.database`                                            |
|        | `aws_iam_role.document_download`                                   |
|        | `aws_iam_role.notification-service-account-role`                   |
|        | `aws_iam_role.secrets_csi_blazer`                                  |
|        | `aws_iam_role.secrets_csi_nginx`                                   |
|        | `module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder` |
| add    | `aws_cloudwatch_query_definition.admin-svc-audit-removed-users[0]` |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/18318584627).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
16:08:53.917 STDOUT terraform:   + create
16:08:53.917 STDOUT terraform:   ~ update in-place
16:08:53.917 STDOUT terraform:  <= read (data resources)
16:08:53.917 STDOUT terraform: Terraform will perform the following actions:
16:08:53.917 STDOUT terraform:   # data.aws_iam_policy_document.assume_role_policy_admin will be read during apply
16:08:53.918 STDOUT terraform:   # (depends on a resource or a module with changes pending)
16:08:53.918 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy_admin" {
16:08:53.918 STDOUT terraform:       + id            = (known after apply)
16:08:53.918 STDOUT terraform:       + json          = (known after apply)
16:08:53.918 STDOUT terraform:       + minified_json = (known after apply)
16:08:53.918 STDOUT terraform:       + statement {
16:08:53.918 STDOUT terraform:           + actions = [
16:08:53.918 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
16:08:53.918 STDOUT terraform:             ]
16:08:53.918 STDOUT terraform:           + effect  = "Allow"
16:08:53.918 STDOUT terraform:           + condition {
16:08:53.918 STDOUT terraform:               + test     = "StringEquals"
16:08:53.918 STDOUT terraform:               + values   = [
16:08:53.918 STDOUT terraform:                   + "sts.amazonaws.com",
16:08:53.918 STDOUT terraform:                 ]
16:08:53.918 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
16:08:53.918 STDOUT terraform:             }
16:08:53.918 STDOUT terraform:           + condition {
16:08:53.918 STDOUT terraform:               + test     = "StringEquals"
16:08:53.918 STDOUT terraform:               + values   = [
16:08:53.918 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notify-admin",
16:08:53.918 STDOUT terraform:                 ]
16:08:53.918 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
16:08:53.919 STDOUT terraform:             }
16:08:53.919 STDOUT terraform:           + principals {
16:08:53.919 STDOUT terraform:               + identifiers = [
16:08:53.919 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
16:08:53.919 STDOUT terraform:                 ]
16:08:53.919 STDOUT terraform:               + type        = "Federated"
16:08:53.919 STDOUT terraform:             }
16:08:53.919 STDOUT terraform:         }
16:08:53.919 STDOUT terraform:     }
16:08:53.919 STDOUT terraform:   # data.aws_iam_policy_document.assume_role_policy_api will be read during apply
16:08:53.919 STDOUT terraform:   # (depends on a resource or a module with changes pending)
16:08:53.919 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy_api" {
16:08:53.919 STDOUT terraform:       + id            = (known after apply)
16:08:53.919 STDOUT terraform:       + json          = (known after apply)
16:08:53.919 STDOUT terraform:       + minified_json = (known after apply)
16:08:53.919 STDOUT terraform:       + statement {
16:08:53.919 STDOUT terraform:           + actions = [
16:08:53.919 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
16:08:53.919 STDOUT terraform:             ]
16:08:53.919 STDOUT terraform:           + effect  = "Allow"
16:08:53.919 STDOUT terraform:           + condition {
16:08:53.919 STDOUT terraform:               + test     = "StringEquals"
16:08:53.919 STDOUT terraform:               + values   = [
16:08:53.919 STDOUT terraform:                   + "sts.amazonaws.com",
16:08:53.919 STDOUT terraform:                 ]
16:08:53.919 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
16:08:53.919 STDOUT terraform:             }
16:08:53.919 STDOUT terraform:           + condition {
16:08:53.919 STDOUT terraform:               + test     = "StringEquals"
16:08:53.920 STDOUT terraform:               + values   = [
16:08:53.920 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notify-api",
16:08:53.920 STDOUT terraform:                 ]
16:08:53.920 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
16:08:53.920 STDOUT terraform:             }
16:08:53.920 STDOUT terraform:           + principals {
16:08:53.920 STDOUT terraform:               + identifiers = [
16:08:53.920 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
16:08:53.920 STDOUT terraform:                 ]
16:08:53.920 STDOUT terraform:               + type        = "Federated"
16:08:53.920 STDOUT terraform:             }
16:08:53.920 STDOUT terraform:         }
16:08:53.920 STDOUT terraform:     }
16:08:53.920 STDOUT terraform:   # data.aws_iam_policy_document.assume_role_policy_celery will be read during apply
16:08:53.920 STDOUT terraform:   # (depends on a resource or a module with changes pending)
16:08:53.920 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy_celery" {
16:08:53.920 STDOUT terraform:       + id            = (known after apply)
16:08:53.920 STDOUT terraform:       + json          = (known after apply)
16:08:53.920 STDOUT terraform:       + minified_json = (known after apply)
16:08:53.920 STDOUT terraform:       + statement {
16:08:53.920 STDOUT terraform:           + actions = [
16:08:53.920 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
16:08:53.920 STDOUT terraform:             ]
16:08:53.920 STDOUT terraform:           + effect  = "Allow"
16:08:53.920 STDOUT terraform:           + condition {
16:08:53.920 STDOUT terraform:               + test     = "StringEquals"
16:08:53.920 STDOUT terraform:               + values   = [
16:08:53.920 STDOUT terraform:                   + "sts.amazonaws.com",
16:08:53.920 STDOUT terraform:                 ]
16:08:53.920 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
16:08:53.921 STDOUT terraform:             }
16:08:53.921 STDOUT terraform:           + condition {
16:08:53.921 STDOUT terraform:               + test     = "StringEquals"
16:08:53.921 STDOUT terraform:               + values   = [
16:08:53.921 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notify-celery",
16:08:53.921 STDOUT terraform:                 ]
16:08:53.921 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
16:08:53.921 STDOUT terraform:             }
16:08:53.921 STDOUT terraform:           + principals {
16:08:53.921 STDOUT terraform:               + identifiers = [
16:08:53.921 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
16:08:53.921 STDOUT terraform:                 ]
16:08:53.921 STDOUT terraform:               + type        = "Federated"
16:08:53.921 STDOUT terraform:             }
16:08:53.921 STDOUT terraform:         }
16:08:53.921 STDOUT terraform:     }
16:08:53.921 STDOUT terraform:   # data.aws_iam_policy_document.assume_role_policy_database will be read during apply
16:08:53.921 STDOUT terraform:   # (depends on a resource or a module with changes pending)
16:08:53.921 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy_database" {
16:08:53.921 STDOUT terraform:       + id            = (known after apply)
16:08:53.921 STDOUT terraform:       + json          = (known after apply)
16:08:53.921 STDOUT terraform:       + minified_json = (known after apply)
16:08:53.921 STDOUT terraform:       + statement {
16:08:53.921 STDOUT terraform:           + actions = [
16:08:53.921 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
16:08:53.921 STDOUT terraform:             ]
16:08:53.921 STDOUT terraform:           + effect  = "Allow"
16:08:53.921 STDOUT terraform:           + condition {
16:08:53.922 STDOUT terraform:               + test     = "StringEquals"
16:08:53.922 STDOUT terraform:               + values   = [
16:08:53.922 STDOUT terraform:                   + "sts.amazonaws.com",
16:08:53.922 STDOUT terraform:                 ]
16:08:53.922 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
16:08:53.922 STDOUT terraform:             }
16:08:53.922 STDOUT terraform:           + condition {
16:08:53.922 STDOUT terraform:               + test     = "StringEquals"
16:08:53.922 STDOUT terraform:               + values   = [
16:08:53.922 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notify-database",
16:08:53.922 STDOUT terraform:                 ]
16:08:53.922 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
16:08:53.922 STDOUT terraform:             }
16:08:53.922 STDOUT terraform:           + principals {
16:08:53.922 STDOUT terraform:               + identifiers = [
16:08:53.922 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
16:08:53.922 STDOUT terraform:                 ]
16:08:53.922 STDOUT terraform:               + type        = "Federated"
16:08:53.922 STDOUT terraform:             }
16:08:53.922 STDOUT terraform:         }
16:08:53.922 STDOUT terraform:     }
16:08:53.922 STDOUT terraform:   # data.aws_iam_policy_document.assume_role_policy_document_download will be read during apply
16:08:53.922 STDOUT terraform:   # (depends on a resource or a module with changes pending)
16:08:53.922 STDOUT terraform:  <= data "aws_iam_policy_document" "assume_role_policy_document_download" {
16:08:53.922 STDOUT terraform:       + id            = (known after apply)
16:08:53.922 STDOUT terraform:       + json          = (known after apply)
16:08:53.923 STDOUT terraform:       + minified_json = (known after apply)
16:08:53.923 STDOUT terraform:       + statement {
16:08:53.923 STDOUT terraform:           + actions = [
16:08:53.923 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
16:08:53.923 STDOUT terraform:             ]
16:08:53.923 STDOUT terraform:           + effect  = "Allow"
16:08:53.923 STDOUT terraform:           + condition {
16:08:53.923 STDOUT terraform:               + test     = "StringEquals"
16:08:53.923 STDOUT terraform:               + values   = [
16:08:53.923 STDOUT terraform:                   + "sts.amazonaws.com",
16:08:53.923 STDOUT terraform:                 ]
16:08:53.923 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
16:08:53.923 STDOUT terraform:             }
16:08:53.923 STDOUT terraform:           + condition {
16:08:53.923 STDOUT terraform:               + test     = "StringEquals"
16:08:53.923 STDOUT terraform:               + values   = [
16:08:53.923 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notify-document-download",
16:08:53.923 STDOUT terraform:                 ]
16:08:53.923 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
16:08:53.923 STDOUT terraform:             }
16:08:53.923 STDOUT terraform:           + principals {
16:08:53.923 STDOUT terraform:               + identifiers = [
16:08:53.923 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
16:08:53.923 STDOUT terraform:                 ]
16:08:53.923 STDOUT terraform:               + type        = "Federated"
16:08:53.923 STDOUT terraform:             }
16:08:53.924 STDOUT terraform:         }
16:08:53.924 STDOUT terraform:     }
16:08:53.924 STDOUT terraform:   # data.aws_iam_policy_document.eks-assume-role-policy will be read during apply
16:08:53.924 STDOUT terraform:   # (depends on a resource or a module with changes pending)
16:08:53.924 STDOUT terraform:  <= data "aws_iam_policy_document" "eks-assume-role-policy" {
16:08:53.924 STDOUT terraform:       + id            = (known after apply)
16:08:53.924 STDOUT terraform:       + json          = (known after apply)
16:08:53.924 STDOUT terraform:       + minified_json = (known after apply)
16:08:53.924 STDOUT terraform:       + statement {
16:08:53.924 STDOUT terraform:           + actions = [
16:08:53.924 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
16:08:53.924 STDOUT terraform:             ]
16:08:53.924 STDOUT terraform:           + effect  = "Allow"
16:08:53.924 STDOUT terraform:           + condition {
16:08:53.924 STDOUT terraform:               + test     = "StringEquals"
16:08:53.924 STDOUT terraform:               + values   = [
16:08:53.924 STDOUT terraform:                   + "system:serviceaccount:notification-canada-ca:notification-service-account",
16:08:53.924 STDOUT terraform:                 ]
16:08:53.924 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
16:08:53.924 STDOUT terraform:             }
16:08:53.924 STDOUT terraform:           + principals {
16:08:53.924 STDOUT terraform:               + identifiers = [
16:08:53.924 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
16:08:53.925 STDOUT terraform:                 ]
16:08:53.925 STDOUT terraform:               + type        = "Federated"
16:08:53.925 STDOUT terraform:             }
16:08:53.925 STDOUT terraform:         }
16:08:53.925 STDOUT terraform:     }
16:08:53.925 STDOUT terraform:   # data.aws_iam_policy_document.secrets_csi_assume_role_policy_blazer will be read during apply
16:08:53.925 STDOUT terraform:   # (depends on a resource or a module with changes pending)
16:08:53.925 STDOUT terraform:  <= data "aws_iam_policy_document" "secrets_csi_assume_role_policy_blazer" {
16:08:53.925 STDOUT terraform:       + id            = (known after apply)
16:08:53.925 STDOUT terraform:       + json          = (known after apply)
16:08:53.925 STDOUT terraform:       + minified_json = (known after apply)
16:08:53.925 STDOUT terraform:       + statement {
16:08:53.925 STDOUT terraform:           + actions = [
16:08:53.925 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
16:08:53.925 STDOUT terraform:             ]
16:08:53.925 STDOUT terraform:           + effect  = "Allow"
16:08:53.925 STDOUT terraform:           + condition {
16:08:53.925 STDOUT terraform:               + test     = "StringEquals"
16:08:53.925 STDOUT terraform:               + values   = [
16:08:53.925 STDOUT terraform:                   + "sts.amazonaws.com",
16:08:53.925 STDOUT terraform:                 ]
16:08:53.925 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
16:08:53.925 STDOUT terraform:             }
16:08:53.925 STDOUT terraform:           + condition {
16:08:53.925 STDOUT terraform:               + test     = "StringEquals"
16:08:53.925 STDOUT terraform:               + values   = [
16:08:53.925 STDOUT terraform:                   + "system:serviceaccount:tools:blazer",
16:08:53.925 STDOUT terraform:                 ]
16:08:53.925 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
16:08:53.926 STDOUT terraform:             }
16:08:53.926 STDOUT terraform:           + principals {
16:08:53.926 STDOUT terraform:               + identifiers = [
16:08:53.926 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
16:08:53.926 STDOUT terraform:                 ]
16:08:53.926 STDOUT terraform:               + type        = "Federated"
16:08:53.926 STDOUT terraform:             }
16:08:53.926 STDOUT terraform:         }
16:08:53.926 STDOUT terraform:     }
16:08:53.926 STDOUT terraform:   # data.aws_iam_policy_document.secrets_csi_assume_role_policy_nginx will be read during apply
16:08:53.926 STDOUT terraform:   # (depends on a resource or a module with changes pending)
16:08:53.926 STDOUT terraform:  <= data "aws_iam_policy_document" "secrets_csi_assume_role_policy_nginx" {
16:08:53.926 STDOUT terraform:       + id            = (known after apply)
16:08:53.926 STDOUT terraform:       + json          = (known after apply)
16:08:53.926 STDOUT terraform:       + minified_json = (known after apply)
16:08:53.926 STDOUT terraform:       + statement {
16:08:53.926 STDOUT terraform:           + actions = [
16:08:53.926 STDOUT terraform:               + "sts:AssumeRoleWithWebIdentity",
16:08:53.926 STDOUT terraform:             ]
16:08:53.926 STDOUT terraform:           + effect  = "Allow"
16:08:53.926 STDOUT terraform:           + condition {
16:08:53.926 STDOUT terraform:               + test     = "StringEquals"
16:08:53.926 STDOUT terraform:               + values   = [
16:08:53.926 STDOUT terraform:                   + "sts.amazonaws.com",
16:08:53.926 STDOUT terraform:                 ]
16:08:53.926 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud"
16:08:53.927 STDOUT terraform:             }
16:08:53.927 STDOUT terraform:           + condition {
16:08:53.927 STDOUT terraform:               + test     = "StringEquals"
16:08:53.927 STDOUT terraform:               + values   = [
16:08:53.927 STDOUT terraform:                   + "system:serviceaccount:nginx:ingress-nginx-ingress",
16:08:53.927 STDOUT terraform:                 ]
16:08:53.927 STDOUT terraform:               + variable = "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub"
16:08:53.927 STDOUT terraform:             }
16:08:53.927 STDOUT terraform:           + principals {
16:08:53.927 STDOUT terraform:               + identifiers = [
16:08:53.927 STDOUT terraform:                   + "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60",
16:08:53.927 STDOUT terraform:                 ]
16:08:53.927 STDOUT terraform:               + type        = "Federated"
16:08:53.927 STDOUT terraform:             }
16:08:53.927 STDOUT terraform:         }
16:08:53.927 STDOUT terraform:     }
16:08:53.927 STDOUT terraform:   # aws_cloudwatch_query_definition.admin-svc-audit-removed-users[0] will be created
16:08:53.927 STDOUT terraform:   + resource "aws_cloudwatch_query_definition" "admin-svc-audit-removed-users" {
16:08:53.928 STDOUT terraform:       + id                  = (known after apply)
16:08:53.928 STDOUT terraform:       + log_group_names     = [
16:08:53.928 STDOUT terraform:           + "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application",
16:08:53.928 STDOUT terraform:         ]
16:08:53.928 STDOUT terraform:       + name                = "Admin / Service audit - removed users"
16:08:53.928 STDOUT terraform:       + query_definition_id = (known after apply)
16:08:53.928 STDOUT terraform:       + query_string        = <<-EOT
16:08:53.928 STDOUT terraform:             fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
16:08:53.928 STDOUT terraform:             | filter kubernetes.container_name like /notify-admin/
16:08:53.928 STDOUT terraform:             | filter @message like /is removing user/
16:08:53.928 STDOUT terraform:             | parse @message "User * is removing user: * from service: *" as @admin_user, @removed_user, @service
16:08:53.928 STDOUT terraform:             | sort @timestamp desc
16:08:53.928 STDOUT terraform:             | display @timestamp, @admin_user, @removed_user, @service, log
16:08:53.928 STDOUT terraform:             | limit 20
16:08:53.928 STDOUT terraform:         EOT
16:08:53.928 STDOUT terraform:       + region              = "ca-central-1"
16:08:53.928 STDOUT terraform:     }
16:08:53.928 STDOUT terraform:   # aws_iam_openid_connect_provider.notification-canada-ca will be updated in-place
16:08:53.928 STDOUT terraform:   ~ resource "aws_iam_openid_connect_provider" "notification-canada-ca" {
16:08:53.928 STDOUT terraform:         id              = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
16:08:53.928 STDOUT terraform:         tags            = {}
16:08:53.928 STDOUT terraform:       ~ thumbprint_list = [
16:08:53.928 STDOUT terraform:           ~ "9e99a48a9960b14926bb7f3b02e22da2b0ab7280" -> "06b25927c42a721631c1efd9431e648fa62e1e39",
16:08:53.928 STDOUT terraform:         ]
16:08:53.928 STDOUT terraform:         # (4 unchanged attributes hidden)
16:08:53.928 STDOUT terraform:     }
16:08:53.928 STDOUT terraform:   # aws_iam_role.admin will be updated in-place
16:08:53.928 STDOUT terraform:   ~ resource "aws_iam_role" "admin" {
16:08:53.928 STDOUT terraform:       ~ assume_role_policy    = jsonencode(
16:08:53.928 STDOUT terraform:             {
16:08:53.928 STDOUT terraform:               - Statement = [
16:08:53.928 STDOUT terraform:                   - {
16:08:53.928 STDOUT terraform:                       - Action    = "sts:AssumeRoleWithWebIdentity"
16:08:53.928 STDOUT terraform:                       - Condition = {
16:08:53.928 STDOUT terraform:                           - StringEquals = {
16:08:53.928 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
16:08:53.928 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notify-admin"
16:08:53.929 STDOUT terraform:                             }
16:08:53.929 STDOUT terraform:                         }
16:08:53.929 STDOUT terraform:                       - Effect    = "Allow"
16:08:53.929 STDOUT terraform:                       - Principal = {
16:08:53.929 STDOUT terraform:                           - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
16:08:53.929 STDOUT terraform:                         }
16:08:53.929 STDOUT terraform:                     },
16:08:53.929 STDOUT terraform:                 ]
16:08:53.929 STDOUT terraform:               - Version   = "2012-10-17"
16:08:53.929 STDOUT terraform:             }
16:08:53.929 STDOUT terraform:         ) -> (known after apply)
16:08:53.929 STDOUT terraform:         id                    = "admin-eks-role"
16:08:53.929 STDOUT terraform:         name                  = "admin-eks-role"
16:08:53.929 STDOUT terraform:         tags                  = {}
16:08:53.929 STDOUT terraform:         # (11 unchanged attributes hidden)
16:08:53.929 STDOUT terraform:     }
16:08:53.929 STDOUT terraform:   # aws_iam_role.api will be updated in-place
16:08:53.929 STDOUT terraform:   ~ resource "aws_iam_role" "api" {
16:08:53.929 STDOUT terraform:       ~ assume_role_policy    = jsonencode(
16:08:53.929 STDOUT terraform:             {
16:08:53.929 STDOUT terraform:               - Statement = [
16:08:53.929 STDOUT terraform:                   - {
16:08:53.929 STDOUT terraform:                       - Action    = "sts:AssumeRoleWithWebIdentity"
16:08:53.929 STDOUT terraform:                       - Condition = {
16:08:53.929 STDOUT terraform:                           - StringEquals = {
16:08:53.929 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
16:08:53.929 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notify-api"
16:08:53.929 STDOUT terraform:                             }
16:08:53.929 STDOUT terraform:                         }
16:08:53.929 STDOUT terraform:                       - Effect    = "Allow"
16:08:53.929 STDOUT terraform:                       - Principal = {
16:08:53.929 STDOUT terraform:                           - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
16:08:53.929 STDOUT terraform:                         }
16:08:53.929 STDOUT terraform:                     },
16:08:53.929 STDOUT terraform:                 ]
16:08:53.929 STDOUT terraform:               - Version   = "2012-10-17"
16:08:53.929 STDOUT terraform:             }
16:08:53.929 STDOUT terraform:         ) -> (known after apply)
16:08:53.929 STDOUT terraform:         id                    = "api-eks-role"
16:08:53.929 STDOUT terraform:         name                  = "api-eks-role"
16:08:53.929 STDOUT terraform:         tags                  = {}
16:08:53.929 STDOUT terraform:         # (11 unchanged attributes hidden)
16:08:53.929 STDOUT terraform:     }
16:08:53.929 STDOUT terraform:   # aws_iam_role.celery will be updated in-place
16:08:53.929 STDOUT terraform:   ~ resource "aws_iam_role" "celery" {
16:08:53.930 STDOUT terraform:       ~ assume_role_policy    = jsonencode(
16:08:53.930 STDOUT terraform:             {
16:08:53.930 STDOUT terraform:               - Statement = [
16:08:53.930 STDOUT terraform:                   - {
16:08:53.930 STDOUT terraform:                       - Action    = "sts:AssumeRoleWithWebIdentity"
16:08:53.930 STDOUT terraform:                       - Condition = {
16:08:53.930 STDOUT terraform:                           - StringEquals = {
16:08:53.930 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
16:08:53.930 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notify-celery"
16:08:53.930 STDOUT terraform:                             }
16:08:53.930 STDOUT terraform:                         }
16:08:53.930 STDOUT terraform:                       - Effect    = "Allow"
16:08:53.930 STDOUT terraform:                       - Principal = {
16:08:53.930 STDOUT terraform:                           - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
16:08:53.930 STDOUT terraform:                         }
16:08:53.930 STDOUT terraform:                     },
16:08:53.930 STDOUT terraform:                 ]
16:08:53.930 STDOUT terraform:               - Version   = "2012-10-17"
16:08:53.930 STDOUT terraform:             }
16:08:53.930 STDOUT terraform:         ) -> (known after apply)
16:08:53.930 STDOUT terraform:         id                    = "celery-eks-role"
16:08:53.930 STDOUT terraform:         name                  = "celery-eks-role"
16:08:53.930 STDOUT terraform:         tags                  = {}
16:08:53.930 STDOUT terraform:         # (11 unchanged attributes hidden)
16:08:53.930 STDOUT terraform:     }
16:08:53.930 STDOUT terraform:   # aws_iam_role.database will be updated in-place
16:08:53.930 STDOUT terraform:   ~ resource "aws_iam_role" "database" {
16:08:53.930 STDOUT terraform:       ~ assume_role_policy    = jsonencode(
16:08:53.930 STDOUT terraform:             {
16:08:53.930 STDOUT terraform:               - Statement = [
16:08:53.930 STDOUT terraform:                   - {
16:08:53.930 STDOUT terraform:                       - Action    = "sts:AssumeRoleWithWebIdentity"
16:08:53.930 STDOUT terraform:                       - Condition = {
16:08:53.930 STDOUT terraform:                           - StringEquals = {
16:08:53.930 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
16:08:53.930 STDOUT terraform:                               - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:notification-canada-ca:notify-database"
16:08:53.930 STDOUT terraform:                             }
16:08:53.930 STDOUT terraform:                         }
16:08:53.930 STDOUT terraform:                       - Effect    = "Allow"
16:08:53.930 STDOUT terraform:                       - Principal = {
16:08:53.930 STDOUT terraform:                           - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
16:08:53.931 STDOUT terraform:                         }
16:08:53.931 STDOUT terraform:                     },
16:08:53.931 STDOUT terraform:                 ]
16:08:53.931 STDOUT terraform:               - Version   = "2012-10-17"
16:08:53.931 STDOUT terraform:             }
16:08:53.931 STDOUT terraform:         ) -> (known after apply)
16:08:53.931 STDOUT terraform:         id                    = "secrets-csi-role-database"
16:08:53.931 STDOUT terraform:         name                  = "secrets-csi-role-database"
16:08:53.931 STDOUT terraform:         tags                  = {}
16:08:53.931 STDOUT terraform:         # (11 unchanged attributes hidden)
16:08:53.931 STDOUT terraform:     }
16:08:53.931 STDOUT terraform:   # aws_iam_role.document_download will be updated in-place
16:08:53.931 STDOUT terraform:   ~ resource "aws_iam_role" "document_download" {
16:08:53.931 STDOUT terraform:       ~ assume_role_policy    =...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.oom-errors[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.blazer[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-host-logs[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
